In [8]:
import pandas as pd
import numpy as np

In [15]:
date = pd.read_csv('orders.csv')[['order_date','customer_id','sales']]
time = pd.read_csv('messages.csv')

In [16]:
date.head()

   order_date customer_id    sales
0  2014-09-07    DK-13375  377.970
1  2014-07-08    EB-13705  699.192
2  2014-03-14    NF-18475   91.056
3  2014-01-28    JC-15340    3.928
4  2014-04-08    JM-15655   21.376

In [17]:
time.head()

                  date                                                msg
0  2012-01-02 00:21:00                            нужен парень 0965188229
1  2012-01-02 00:24:00                       Всем привет! Как настроение?
2  2012-01-02 00:27:00  ИЩЮ ВТОРУЮ ПОЛОВИНКУ МНЕ 23 ЗОВУТ ВАНЯ ПИШИТЕ ...
3  2012-01-02 00:27:00     Эля  встречала в шумной компании! Все отлично!
4  2012-01-02 00:27:00  Парень катается по городу. Нужна девушка. 0992...

In [18]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5009 entries, 0 to 5008
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_date   5009 non-null   object
 1   customer_id  5009 non-null   object
 2   sales        5009 non-null   float64
dtypes: float64(1), object(2)
memory usage: 117.5+ KB

### Working with Dates

In [20]:
date['order_date'] = pd.to_datetime(date['order_date'])

Extract year

In [21]:
date['date_year'] = date['order_date'].dt.year

In [24]:
date.head()

  order_date customer_id    sales  date_year
0 2014-09-07    DK-13375  377.970       2014
1 2014-07-08    EB-13705  699.192       2014
2 2014-03-14    NF-18475   91.056       2014
3 2014-01-28    JC-15340    3.928       2014
4 2014-04-08    JM-15655   21.376       2014

In [28]:
date['date_week'] = date['order_date'].dt.weekday

In [29]:
date.head()

  order_date customer_id    sales  date_year  date_week
0 2014-09-07    DK-13375  377.970       2014          6
1 2014-07-08    EB-13705  699.192       2014          1
2 2014-03-14    NF-18475   91.056       2014          4
3 2014-01-28    JC-15340    3.928       2014          1
4 2014-04-08    JM-15655   21.376       2014          1

In [31]:
date['quarter'] = date['order_date'].dt.quarter

In [32]:
date.head()

  order_date customer_id    sales  date_year  date_week  quarter
0 2014-09-07    DK-13375  377.970       2014          6        3
1 2014-07-08    EB-13705  699.192       2014          1        3
2 2014-03-14    NF-18475   91.056       2014          4        1
3 2014-01-28    JC-15340    3.928       2014          1        1
4 2014-04-08    JM-15655   21.376       2014          1        2